// #WpkK0ZH1
// --створити масив з:
//     - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let arr=[1,2,3,4,5];
console.log(arr);
let a=['a','b','c','d','e'];
console.log(a);
let b =[1,2,'a',true,false];
console.log(b);

// #4aDbSgh
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
//     Вивести в консоль
let c=[1,2,'s','q'];
console.log(c[0],c[3]);
// #qLQLJSeN7i
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
//     2. перебрати його циклом for
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// debugger;
let users=[2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while(i < users.length) {
//     let user = users[i];
//     console.log(user);
//     i++;
// }
// for ( let i=0; i<users.length; i++){
//     let user=users[i];
//     console.log(user);
// }
let i=0;
while(i < users[0]) {
    let user = users[i];
    console.log(user);
    i++;
}
